[{"course_name":"Applied Probability for Actuarial Science","course_id":"ACT350H1F","description":"The course offers an introduction to elementary probability theory and stochastic processes. The main goal of the course is to help actuarial students understand the concept of stochastic processes with particular emphasis on Markov chains that are of great importance in Life Contingencies and Property and Casualty insurance. The course will cover the following topics: a basic review of probabilities with emphasis on conditional probabilities and expectations, discrete time Markov chains, Poisson processes, continuous time Markov chains, renewal theory and some applications, queueing theory.","lectures":[{"course_id":"ACT350H1F","lecture_id":"L0101","time":[{"day":"Tuesday","start":13,"end":16}]}],"tutorials":[]},{"course_name":"Contemporary Canada","course_id":"ABP102Y1S","description":"This interdisciplinary, foundational course provides an introduction to contemporary Canadian society. The course includes the study of geography, politics, literature and culture through a historical framework of the twentieth century. It also emphasizes particular themes including indigenous issues, Quebec nationalism, gender/women's issues and immigration/multiculturalism. Open only to Academic Bridging Program students. Not eligible for CR/NCR option.","lectures":[{"course_id":"ABP102Y1S","lecture_id":"L5101","time":[{"day":"Tuesday","start":18,"end":21},{"day":"Thursday","start":18,"end":21}]}],"tutorials":[]},{"course_name":"Introduction to University Studies in Chemistry","course_id":"ABP108Y1Y","description":"This course covers the fundamental knowledge and skills needed for success in First Year university Chemistry and other Sciences such as Biology. Topics include atoms, elements, and compounds; the chemical and physical properties of gases, liquids, and solids; chemical reactions; and the importance of chemistry in understanding the world around us, with attention to how it can address issues in medicine, the environment, and sustainability. Open only to Academic Bridging Program students. Not eligible for CR/NCR option.","lectures":[{"course_id":"ABP108Y1Y","lecture_id":"L0101","time":[{"day":"Tuesday","start":10,"end":13}]}],"tutorials":[]},{"course_name":"Methods of Inquiry and Investigation for ACM Programs","course_id":"ACMB02H3S","description":"An introduction to investigative research methods where the humanities and social sciences meet including visual, documentary, ethnographic, interview and other qualitative tools for analyzing social and cultural practices. Students develop skills to identify research inquiries, formulate approaches to investigate, locate, collect and learn from data, analyze evidence, and communicate results.","lectures":[{"course_id":"ACMB02H3S","lecture_id":"L01","time":[{"day":"Wednesday","start":13,"end":15}]}],"tutorials":[{"course_id":"ACMB02H3S","tutorial_id":"T0006","time":[{"day":"Friday","start":13,"end":14}]},{"course_id":"ACMB02H3S","tutorial_id":"T0001","time":[{"day":"Wednesday","start":15,"end":16}]},{"course_id":"ACMB02H3S","tutorial_id":"T0002","time":[{"day":"Wednesday","start":16,"end":17}]},{"course_id":"ACMB02H3S","tutorial_id":"T0003","time":[{"day":"Friday","start":10,"end":11}]},{"course_id":"ACMB02H3S","tutorial_id":"T0004","time":[{"day":"Friday","start":11,"end":12}]},{"course_id":"ACMB02H3S","tutorial_id":"T0005","time":[{"day":"Friday","start":12,"end":13}]}]},{"course_name":"Critical Reading, Thinking and Writing for ACM Programs","course_id":"ACMB01H3S","description":"Academic study in the Department of Arts, Culture and Media is distinguished by critical, historical and practice-based approaches to text, image, sound and performance. This course focuses on critical reading, thinking and writing skills while introducing students to humanistic inquiry through lectures, readings, discussions, and attendance of campus performances and gallery exhibits. This is a writing intensive course that offers students regular constructive feedback on their work.","lectures":[{"course_id":"ACMB01H3S","lecture_id":"L02","time":[{"day":"Thursday","start":11,"end":13}]},{"course_id":"ACMB01H3S","lecture_id":"L03","time":[{"day":"Thursday","start":13,"end":15}]},{"course_id":"ACMB01H3S","lecture_id":"L01","time":[{"day":"Thursday","start":9,"end":11}]},{"course_id":"ACMB01H3S","lecture_id":"L04","time":[{"day":"Thursday","start":16,"end":18}]},{"course_id":"ACMB01H3S","lecture_id":"L30","time":[{"day":"Thursday","start":17,"end":19}]},{"course_id":"ACMB01H3S","lecture_id":"L31","time":[{"day":"Thursday","start":19,"end":21}]}],"tutorials":[]},{"course_name":"Basic Ratemaking Methods For P&C Insurance","course_id":"ACT372H1S","description":"This course covers the basic ratemaking methods for P&C insurance. It assumes that students are familiar with traditional reserving diagnoses and projection methods. The syllabus would introduce concepts related to earning of exposures, on-level factors, catastrophe loading, large loss loading and credibility. Not eligible for CR/NCR option.","lectures":[{"course_id":"ACT372H1S","lecture_id":"L5101","time":[{"day":"Wednesday","start":18,"end":21}]}],"tutorials":[]},{"course_name":"Financial Principles for Actuarial Science I","course_id":"ACT245H1S","description":"Term structure of interest rates, cashflow duration, convexity and immunization, forward and futures contracts, interest rate swaps, introduction to investment derivatives and hedging strategies.","lectures":[{"course_id":"ACT245H1S","lecture_id":"L0101","time":[{"day":"Tuesday","start":15,"end":17},{"day":"Thursday","start":14,"end":15}]}],"tutorials":[]},{"course_name":"Credibility and Simulation","course_id":"ACT466H1S","description":"Limited fluctuation credibility, Bayesian estimation, Buhlmann credibility, non-parametric credibility methods, inverse transformation simulation method, specialized simulation methods for the normal and lognormal distributions, Monte Carlo methods, the bootstrap method.","lectures":[{"course_id":"ACT466H1S","lecture_id":"L0101","time":[{"day":"Tuesday","start":11,"end":12},{"day":"Thursday","start":10,"end":12}]}],"tutorials":[]},{"course_name":"Financial Principles for Actuarial Science II","course_id":"ACT370H1S","description":"Mathematical theory of financial derivatives, discrete and continuous option pricing models, hedging strategies and exotic option valuation.","lectures":[{"course_id":"ACT370H1S","lecture_id":"L0101","time":[{"day":"Monday","start":11,"end":12},{"day":"Wednesday","start":12,"end":14}]},{"course_id":"ACT370H1S","lecture_id":"L2001","time":[{"day":"Monday","start":11,"end":12},{"day":"Wednesday","start":12,"end":14}]}],"tutorials":[]},{"course_name":"Introduction to Environmental Studies","course_id":"ABP104Y1Y","description":"This interdisciplinary course introduces the major issues regarding the sustainability of the global environment in the face of human development by integrating humanities and social science with the fundamental concept of environmental science. It examines major environmental problems, such as rapid climate change and land degradation as well as the role and impact of government, economics, and ethics on environmental issues. Open only to Academic Bridging Program students. Not eligible for CR/NCR option.","lectures":[],"tutorials":[]}]